const nihongo = {
  arufa: '',
  hiragana: ''
}

const K = {
  /* 五十音 */
  /* A */ 65: ['あ', 'ア'], /* I */　73: ['い', 'イ'], /* U */　85: ['う', 'ウ'], /* E */　69: ['え', 'エ'], /* O */　79: ['お', 'オ'],
  /* K */ 75: { 65: ['か', 'カ'], 73: ['き', 'キ'], 85: ['く', 'ク'], 69: ['け', 'ケ'], 79: ['こ', 'コ'] },
  /* S */ 83: {
    /* A */ 65: ['さ', 'サ'], 73: ['し', 'シ'], 85: ['す', 'ス'], 69: ['せ', 'セ'], 79: ['そ', 'ソ'],
    /* Y */ 89: { 65: ['しゃ', 'シャ'], 73: ['ぎぃ', 'ギィ'], 85: ['ぎゅ', 'ギュ'], 69: ['ぎぇ', 'ギェ'], 79: ['ぎょ', 'ギョ'] },
    /* H */ 72: { 65: ['しゃ', 'シャ'], 73: ['し', 'シ'], 85: ['しゅ', 'シュ'], 69: ['しぇ', 'シェ'], 79: ['しょ', 'ショ'] }
  /*****/ },
  /* T */ 84: { 65: ['た', 'タ'], 73: ['ち', 'チ'], 85: ['つ', 'ツ'], 69: ['て', 'テ'], 79: ['と', 'ト'] },
  /* N */ 78: {
    /* A */ 65: ['な', 'ナ'], 73: ['に', 'ニ'], 85: ['ぬ', 'ヌ'], 69: ['ね', 'ネ'], 79: ['の', 'ノ'],
    /* Y */ 89: { 65: ['にゃ', 'ニャ'], 73: ['にぃ', 'ニィ'], 85: ['にゅ', 'ニュ'], 69: ['にぇ', 'ニェ'], 79: ['にょ', 'ニョ'] },
    /* N */ 78: ['ん', 'ン']
  /*****/ },
  /* H */ 72: { 65: ['は', 'ハ'], 73: ['ひ', 'ヒ'], 85: ['ふ', 'フ'], 69: ['へ', 'ヘ'], 79: ['ほ', 'ホ'] },
  /* M */ 77: { 65: ['ま', 'マ'], 73: ['み', 'ミ'], 85: ['む', 'ム'], 69: ['め', 'メ'], 79: ['も', 'モ'] },
  /* Y */ 89: { 65: ['や', 'ヤ'], 85: ['ゆ', 'ユ'], 79: ['よ', 'ヨ'] },
  /* R */ 82: { 65: ['ら', 'ラ'], 73: ['り', 'リ'], 85: ['る', 'ル'], 69: ['れ', 'レ'], 79: ['ろ', 'ロ'] },
  /* W */ 87: { 65: ['わ', 'ワ'], 73: ['うぃ', 'ウィ'], 69: ['うぇ', 'ウェ'], 79: ['を', 'ヲ'] },

  /* 浊音 */
  /* G */ 71: {
    /* A */ 65: ['が', 'ガ'], 73: ['ぎ', 'ギ'], 85: ['ぐ', 'グ'], 69: ['げ', 'ゲ'], 79: ['ご', 'ゴ'],
    /* Y */ 89: { 65: ['ぎゃ', 'ギャ'], 73: ['ぎぃ', 'ギィ'], 85: ['ぎゅ', 'ギュ'], 69: ['ぎぇ', 'ギェ'], 79: ['ぎょ', 'ギョ'] }
  /*****/ },
  /* Z */ 90: { 65: ['ざ', 'ザ'], 73: ['じ', 'ジ'], 85: ['ず', 'ズ'], 69: ['ぜ', 'ゼ'], 79: ['ぞ', 'ゾ'] },
  /* D */ 68: { 65: ['だ', 'ダ'], 73: ['ぢ', 'ヂ'], 85: ['づ', 'ヅ'], 69: ['で', 'デ'], 79: ['ど', 'ド'] },
  /* B */ 66: { 65: ['ば', 'バ'], 73: ['び', 'ビ'], 85: ['ぶ', 'ブ'], 69: ['べ', 'ベ'], 79: ['ぼ', 'ボ'] },

  /* 半浊音 */
  /* P */ 80: {
    /* A */ 65: ['ぱ', 'パ'], 73: ['ぴ', 'ピ'], 85: ['ぷ', 'プ'], 69: ['ぺ', 'ペ'], 79: ['ぽ', 'ポ'],
    /* Y */ 89: { 65: ['ぴゃ', 'ピャ'], 73: ['ぴぃ', 'ピィ'], 85: ['ぴゅ', 'ピュ'], 69: ['ぴぇ', 'ピェ'], 79: ['ぴょ', 'ピョ'] }
  /*****/ },

  /* 拗音 */
  /* J */ 74: {
    /* A */ 65: ['じゃ', 'ジャ'], 73: ['じぃ', 'ジィ'], 85: ['じゅ', 'ジュ'], 69: ['じぇ', 'ジェ'], 79: ['じょ', 'ジョ'],
    /* Y */ 89: { 65: ['じゃ', 'ジャ'], 73: ['じぃ', 'ジィ'], 85: ['じゅ', 'ジュ'], 69: ['じぇ', 'ジェ'], 79: ['じょ', 'ジョ'] }
  /*****/ },

  /* 外来语 */
  /* V */ 86: { 65: ['ゔぁ', 'ヴァ'], 73: ['ゔぃ', 'ヴィ'], 85: ['ゔ', 'ヴ'], 69: ['ゔぇ', 'ヴェ'], 79: ['ゔぉ', 'ヴォ'] },
  /* F */ 70: { 65: ['ふぁ', 'ファ'], 73: ['ふぃ', 'フィ'], 85: ['ふ', 'フ'], 69: ['ふぇ', 'フェ'], 79: ['ふぉ', 'フォ'] },

  /* 小字符 */
  /* L */ 77: { 65: ['ぁ', 'ァ'], 73: ['ぃ', 'ィ'], 85: ['ぅ', 'ゥ'], 69: ['ぇ', 'ェ'], 79: ['ぉ', 'ォ'] },

  /* 长音 */
  189: ['ー']
}

document.onreadystatechange = () => {
  if (document.readyState === 'complete') {
    var text = document.querySelectorAll('input[type=text]');
    var textarea = document.querySelectorAll('textarea');

    // console.log(`text:${text.length}`);
    // console.log(`textarea:${textarea.length}`);

    if(text.length !== 0) {
      text.forEach((item, index) => {
        item.addEventListener('focus', () => {
          hajime(item)
        });
      });
    }

    if(textarea.length !== 0) {
      textarea.forEach((item, index) => {
        item.addEventListener('focus', () => {
          hajime(item)
        });
      });
    }
  }
}

function hajime(item) {
  // item.blur();
  item.nihongo = item.nihongo || nihongo;
  var bokkusu = document.querySelector('.nihongo-bokkusu') || document.createElement('div');
  var pointaa = document.querySelector('.nihongo-pointaa') || document.createElement('div');
  var mein = document.querySelector('#nihongo');
  if(!mein) {
    mein = document.createElement('div');
    mein.setAttribute('id', 'nihongo');
    bokkusu.setAttribute('class', 'nihongo-bokkusu');
    pointaa.setAttribute('class', 'nihongo-pointaa');
    bokkusu.appendChild(pointaa);
    mein.appendChild(bokkusu);
  }

}
