const Btools = {
  'info': '%c ____     __                   ___\n/\\  _`\\  /\\ \\__               /\\_ \\\n\\ \\ \\L\\ \\\\ \\ ,_\\   ___     ___\\//\\ \\     ____\n \\ \\  _ <\'\\ \\ \\/  / __`\\  / __`\\\\ \\ \\   /\',__\\\n  \\ \\ \\L\\ \\\\ \\ \\_/\\ \\L\\ \\/\\ \\L\\ \\\\_\\ \\_/\\__, `\\ \n   \\ \\____/ \\ \\__\\ \\____/\\ \\____//\\____\\/\\____/\n    \\/___/   \\/__/\\/___/  \\/___/ \\/____/\\/___/\n\n                  version 0.0.1  Power By imba久期',
  'infoColor': 'color:#00a1d6',
  'Reg': {
    'favlist' : '/(?:http|https):\/\/space\.bilibili\.com\/\d*\/favlist\??/i'
  }
}


console.log(Btools.info,Btools.infoColor);
